xmlFiles/bodyForRequestToGetTCIds.xml

<s:Envelope
        xmlns:s="http://www.w3.org/2003/05/soap-envelope">
    <s:Body>
        <FetchTestSuites
            xmlns="http://schemas.microsoft.com/TeamFoundation/2007/02/TCM/TestResults/01">
            <teamProjectName>projectName</teamProjectName>
            <suiteIds>
                <IdAndRev Id="30146"/>
            </suiteIds>
        </FetchTestSuites>
    </s:Body>
</s:Envelope>